Staok/stm32_framework/STM32F1_HAL_freeRTOS_Framework/SYSTEM/sys.h
#ifndef __SYS_H
#define __SYS_H

#include "sysVar.h"								/*定义系统级常用的变量、数据类型和二进制表示宏*/
#include "stm32f1xx.h"
#include "stm32f1xx_hal.h"						/*在里面的stm32f1xx_hal_conf.h里面选择用哪些外设的HAL库——————！按需要进行修改！*/
//#include "FIFO.h"								
												/*用Github上面的一个开源仓库，
												一个实现对任何形式数据的环形缓存，默认已经用于串口接收，参考程序看.h文件内
												开源仓库地址：https://github.com/geekfactory/FIFO.git*/
												
												
#include "malloc.h"								/*借鉴正点原子的 内存管理 章节的源代码自实现的malloc和free*/				
												
												
												
/*用户设备驱动和APP文件调用*/
#include "TFTLCD.h"
												
												

/*
编程和应用规范：
	No.1：紧凑，通用，可迭代，高内聚低耦合，广泛借鉴
	No.2: 尽量减少数据传输过程中的拷贝，常用指针、结构体指针当传输数据，函数形参带const修饰符
	No.3: 一类或者一个模块内的变量尽量用结构体打包，多组数据就用结构体数组
		  函数返回值0表示成功，正数表示失败，此正数可以表示错误代码
		  IO尽量设计为低电平有效，高电平截止；按键IO尽量都使用外部中断
		  大块内存使用请用本模板内存管理相关API
		  
		  外设相关的所有API均在：
				#include "sys.h"
				里面，APP编写时按需要在.c文件内调用这个即可
		独立IO口相关的所有API均在：
				#include "PeriphConfig.h"
				里面，APP编写时按需要在.c文件内调用这个即可

*/

/*
命名规范：（临时）
	0、函数命名规则为“属什么是什么做什么”，如：sys_irq_disable()，属于sys级别函数，是irq管理，做dsiable的功能
	1、系统使用外设功能的启用与否均用宏定义SYSTEM_SUPPORT_XX
	2、RTOS任务函数均使用xx_task()命名
	3、任务函数与任务名称一致，任务索引与函数一致，只是task部分简写为t
	4、函数注释规范如下：*/
	
	/*__________函数简述_____________*/
	/********************************
	*描述：函数详细描述——————！按需要进行修改！
	*参数：		1、...
				2、...
	*返回值：	1、NULL
	********************************/
	
	/*
	5、
	6、
	7、MCU外设统称"外设"，即Periph，用户的MCU外围芯片和设备统称"器件"或"设备",即devices
	*/
	
/*本模板默认和规范的事项：（临时，待整理）
	00、工程内现已经不含string、stdio和stdlib等不适合用于mcu平台的头文件，已经都用开源的线程安全软件或者自实现替换
		（对于FreeRTOS包含stdlib库、stdio库和string库，没办法）
	0、中断优先级分组选用分组4，即16级抢占优先级，0级响应优先级（即不用）
	1、IO的低电平为有效电平，高电平截止或者无效；按键IO尽量都使用外部中断
	2、使用C99模式编译！
	3、I2C使用软件实现
	4、FreeRTOS所有组件始终使用动态申请内存；FreeRTOS的配置文件除了用户按需更改区域，尽量不要动；一般不使用软件定时器，用硬件定时器或者周期延时替代即可
	
	5、定时器4默认用于提供模板心跳的10ms时基，必须开启并且不可更改
	6、定时器3默认用于产生PWM，默认开启通道4用于无源报警蜂鸣器，必须开启，但可以更改参数；并且可选开启定时中断，提供一个同步功能
	6、定时器2是多功能的，可选用于定时中断、PWM、输入捕获和正交解码（编码器解码），是否启用和参数用户可自行更改
	6、定时器5本模板没有提供选项，用户可按照需求自己灵活编写驱动代码
	7、定时器6、7仅提供是否开启选项，只能用于定时中断，提供更多的同步功能
	7、定时器1、8是高级定时器，专门用于产生PWM，定时器1支持1~3通道互补PWM输出和4通道PWM输出，有刹车功能，是否启用和参数用户可自行更改
	
	7、外设如串口、PWM等的IO初始化在其初始化函数内，不用单独再初始化
	8、函数返回值：0表正确，正数表错误并带返回信息，并尽量用HAL类型返回值如：
		  HAL_OK       = 0x00U,
		  HAL_ERROR    = 0x01U,
		  HAL_BUSY     = 0x02U,
		  HAL_TIMEOUT  = 0x03U
	9、FSMC的块1的区3和区4分别留给外部RAM和LCD，本模板默认的，慎改
	10、把本模板各种外设中默认的东西都罗列在这里
		
*/

/*坑说明：
	1、由于历史遗留原因，本MDK工程编码位GB2312，所以用外部文件写程序时请选用GB2312编码来写
		但是如果已经使用UTF-8等编码编写了很多内容时，只需用notepad软件新建一个新文件，选择GB2312编码，然后复制原来UTF-8等编码格式的原文进来，就自动转为GB2312编码了
		
		
*/

/*
STM32F10xx系列命名规范：

STM32F
	  101 = 		基本型
	  102 = 		USB基本型， USB 2.0全速设备
	  103 = 		增强型
	  105或107 = 	互联型
			  T = 36脚
			  C = 48脚
			  R = 64脚
			  V = 100脚
			  Z = 144脚
			  I = 176脚
			   4 = 16KB(ld)
			   6 = 32KB(ld)
			   8 = 64KB(md)
			   B = 128KB(md)
			   C = 256KB(hd)
			   D = 384KB(hd)
			   E = 512KB(hd)
			   G = 1024KB(hd)
			    H = BGA封装
				T = LQFP封装
				 6 = -40~85℃
			FLASH               RAM
			
			16K(ld)				6K			ld:2个USART，3个16位定时器+1个16位电机控制定时器，1个SPI，1个I2C，USB，CAN，1个高级定时器，2个ADC，DMA1（7通道）
			32K(ld)				10K
			
			64K(md)				20K			md:3个USART，4个16位定时器+1个16位电机控制定时器，2个SPI，2个I2C，USB，CAN，1个高级定时器，2个ADC（通道数不定）
			128K(md)			20K						(x8/xB系列有1、2、3、4定时器)，DMA1（7通道）
			
			256K(hd)			48K或64K	hd:3+2个串口，8个以上16位定时器+2个以上16位电机控制定时器，2个基本定时器，3个SPI，2个I2S，2个I2C，USB，CAN，
			384K(hd)			64K				2个高级定时器，3个ADC（通道数不定），2个12bit DAC，1个SDIO，FSMC(100和144脚封装)，DMA1（7通道）、2（5通道）
			512K(hd)			64K
*/

/*
启动：	BOOT1	BOOT0		启动区域
		  x		  0			FLASH
		  0		  1			系统储存器(ISP下载)
		  1		  1			SRAM
*/

/*
需要 256K(hd) 及以上IC的外设列表：
	SDIO
	DAC
	FSMC
	DMA2
	TIM6\7\8
	
	在STM32F103系列之间切换容量或者芯片时，需要配置以下几项：
	1、在 Device 里改芯片型号
	2、在 C/C++ 里面改 Symbols 到相应芯片型号，可选：
		STM32F103x6 —— STM32F103xB —— STM32F103xE ——  STM32F103xG 
	3、（第一步完成后这里就自动改了，再检查一下）在 Debug 里面的 下载Settings 里面的 Flash Download 里面改相应的小、中大容量下载算法
	4、在当前工程的CORE文件夹里 只保留 相应的startup.s文件，对于中容量为startup_stm32f103xb.s，以此类推
*/

/*
	C编译器中的预定义宏
		VECT_TAB_SRAM         - 增加这个符号表示中断向量表定位在CPU内部RAM （针对在CPU内部RAM运行的工程才需要添加，一般都不用）
*/

#define SYSTEM_SUPPORT_OS		0				/*定义是否使用FreeRTOS，不是0就是1——————！按需要进行修改！
													FreeRTOS版本：v10.3.1
													默认用于任务的RAM堆栈大小为5KB，按需修改！
												注意：还要在FreeRTOSConfig.h里面的SYSTEM_SUPPORT_OS宏定义与此处保持一致，否则系统不会调用FreeRTOS的任务切换SVC中断函数，跑不起来！*/

#define SYSTEM_SUPPORT_Menu		1				/*模板固定搭配！提供一个菜单模板，把系统的输入、输出、执行功能的标志位控制全部打包！*/
/*
	以下两个函数推荐100ms周期运行
	keyProcess(); 	//获取键值输入函数；对于RTOS，直接放一个100ms周期任务；对于裸机，100ms周期运行（仅裸机已经放了） ！输入可以为独立按键、五项按键、AD Key、触摸按键、无线遥控、旋转编码器等
	menuProcess();	//菜单处理的主函数；同上
*/
#define SYSTEM_SUPPORT_MyString	1				/*提供一个实现了string.h大部分字符操作函数的库*/
/*具体作用看MyString.c文件里的注释
int mystrlen (const char *str);
char * mystrcat (char *dest, const char *src);
char * mystrncat (char *dest, const char *src, int n);
char * mystrcpy (char *dest, const char *src);
char * mystrncpy (char *dest, const char *src, int n);
int mystrcmp (const char *s1, const char *s2);
int mystrncmp (const char *s1, const char *s2, int n);
void * mymemset (void *s, int c, unsigned n);
void *mymemcpy(void *des,const void *src,size_t len);
char *mystrtok(char *s, const char *delim);
*/
int myatoi(const char *str);					/*提供一个字符串转整形的实现*/
u16 sys_GetsysRunTime(u16* mins,u16* secs,u16* _10ms);/*提供获取系统运行时间的函数，具体看源函数处注释*/
#define SYSTEM_SUPPORT_sprintf	1				/*模板固定搭配！包含且编译printf.h，github开源文件，无依赖，功能比较全。
													约占6KB，对于stm32够，对于其他小容量MCU则看“其他几个sprintf实现”文件夹里面的,不要纠结了。
													开源仓库地址：https://github.com/mpaland/printf
													提供API：
													int printf(const char* format, ...); 								不用
													int printf_uart(unsigned char uart,const char* format, ...); 		用，可选发送串口
																		串口选择可选：UART1/UART2/UART3，需要先使能相关串口
													int sprintf(char* buffer, const char* format, ...); 				不带字节数量限制
													int snprintf(char* buffer, size_t count, const char* format, ...); 	带字节数量限制，更安全
												注意：另在SYSTEM文件夹内提供strprintf.h，功能比较单一，但很小。
												*/
#define SYSTEM_SUPPORT_pid		0				/*提供一个pid算法实现库，集成了积分分离和变限积分，以及可选的不完全微分和微分先行，具体用法看pid.h里面*/
												/*里面另提供一个一阶低通滤波实现函数*/
												/*一阶低通滤波器 float FirstOrderLPF(float NewValue);*/
												

/*所有main的头文件都放在这里*/
#if SYSTEM_SUPPORT_OS
	#include "FreeRTOS.h"	//FreeRTOS使用,这里不要乱动	  
	#include "task.h"
	#include "queue.h"
	#include "TaskConfig.h"
#else
	#include "BareConfig.h"
	
//	#include "FreeRTOS.h"  /*这里是为了串口用消息队列接收数据，但是不好使，以后改了不用接收函数的时候这两个include就可以去掉！*/
//	#include "queue.h"
#endif

