Staok/stm32_framework/STM32F1_HAL_freeRTOS_Framework/SYSTEM/sys.h
#if SYSTEM_SUPPORT_Menu
	#include "sys_menu.h"
#endif

#if SYSTEM_SUPPORT_MyString
	#include "MyString.h"
#endif

#if SYSTEM_SUPPORT_sprintf
	#include "printf.h"
#endif

#if SYSTEM_SUPPORT_pid
	#include "pid.h"
#endif

/*_____MCU外设启用选择_____*/
#define SYSTEM_MCO_PA8_OUT		0				/*设置PA8为MCO输出，默认时钟源为HSE*/

/*配置使用RTC，确保LSE连接有36.768kHz的晶振，确保RTC有VBAT备用电源
说明：	按需要在配置函数内设置：时间，闹钟，读存BKP
		默认开启RTC闹钟中断，系统在待机模式下可选被闹钟唤醒
API:
	RTC_Set(2049,10,1,17,7,0); 				//设置RTC日期和时间，年月日时分秒，2049年10月1日，17点07分0秒
	RTC_Alarm_Set(2149,10,1,17,7,0);		//设置RTC闹钟日期和时间，年月日时分秒，2149年10月1日，17点07分0秒
	
	typedef struct //时间结构体
	{
		vu8 hour;
		vu8 min;
		vu8 sec;			
		//公历日月年周
		vu16 w_year;
		vu8  w_month;
		vu8  w_date;
		vu8  week;	
	}_calendar_obj;					 
	extern _calendar_obj calendar;				//用户用！RTC结构体，实际用时只需要读这个结构体获取时间即可
*/
#define SYSTEM_RTC_ENABLE		0				
/*配置使用CRC循环冗余校验
这个CRC计算模块使用常见的、在以太网中使用的计算多项式：
X32 + X26 + X23 + X22 + X16 + X12 + X11 + X10 +X8 + X7 + X5 + X4 + X2 + X + 1
写成16进制就是：0x04C11DB7
API：参数：const uint32_t aDataBuffer[BUFFER_SIZE]; #define BUFFER_SIZE    114
	HAL_CRC_Accumulate(&hcrc, (uint32_t *)aDataBuffer, BUFFER_SIZE); //返回值为uint32_t的计算结果*/
#define SYSTEM_CRC_ENABLE		1
/*
F103系列有以下8个定时器：其中x8/xB系列仅有1、2、3、4定时器，xE和以上有全八个。
高级定时器1、8（定时器中断，
	高级PWM（7路，具体在xxx引脚，重映射在xxx引脚，形式如HAL F1手册的225页的表）），
通用定时器2-5（都为16位计数）
	（4路，定时中断，输入捕获，输出比较，PWM 生成(边缘或中间对齐模式)，单脉冲模式输出，正交编码中断
基本定时器6、7（仅定时器中断，无PWM等）
*/
#define STSTEM_TIM4_ENABLE		1			/*模板基本功能，必须开启！使用通用定时器4，提供时基，默认10ms周期中断*/
/*提供用于同步和计时的时基：
	Timer_IT_flags._10msec_flag		//10毫秒标志
	Timer_IT_flags._100msec_flag	//100毫秒标志
	Timer_IT_flags._300msec_flag	//300毫秒标志
	Timer_IT_flags._1sec_flag		//1秒标志
	Timer_IT_flags._1min_flag		//1分钟标志
	
	Timer_IT_flags._10msec			//10毫秒计数
	Timer_IT_flags._100msec			//100毫秒计数
	Timer_IT_flags._1sec			//1秒计数
	Timer_IT_flags._1min			//1分钟计数
*/

/*PWM即输出比较，基本原理就是，每个定时器都有唯一一个CNT计数值，随着时钟源加一，到了Period值就会产生溢出中断即定时中断，
PWM就是四个通道有四个独立的比较值，每个比较值与这个CNT计数值比较，从而产生四路独立的PWM*/
/*初始化后自动打开相应通道的PWM输出*/
#define STSTEM_TIM3PWM_ENABLE	1			/*模板基本功能，必须开启！使用通用定时器3，默认不开启中断，提供四路PWM输出*/
											/*其中一路默认给蜂鸣器，蜂鸣器低电平有效！蜂鸣器控制需要用到TIM4！蜂鸣器连接在TIM3的通道4上！
											改变占空比可调响度，改变频率可调声调*/
											/*默认向上计数，输出极性为LOW，PWM1模式，即设置为当计数值小于此值时输出低电平。*/
											/*默认：引脚上拉									(CH1/PA6, CH2/PA7, CH3/PB0, CH4/PB1)*/
		#define STSTEM_TIM3PWM_REMAP_PARTIAL	0	/*定时器3部分引脚重映射，Partial remap  	(CH1/PB4, CH2/PB5, CH3/PB0, CH4/PB1)*/
		#define STSTEM_TIM3PWM_REMAP_ENABLE		0	/*定时器3全部引脚重映射，Full remap     	(CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9)*/
		#define STSTEM_TIM3PWM_CHANNEL_ENABLE	B0000_1000 /*输出通道选择，共四个通道，通道四必打开*/
													/*可选  B0000_0001|B0000_0010|B0000_0100|B0000_1000	*/
		#define STSTEM_TIM3PWM_TI_ENABLE		0	/*是否开启定时器3的定时中断，除非急需用，否则一般不开*/
		
		
		#define tim3prsc STSTEM_TIM3PWM_Period_5K		/*选择定时器输出频率，以下六条语句基本不动（重装值为720，这里是选择预分频系数）*/
			#define STSTEM_TIM3PWM_Period_2K	(50-1)
			#define STSTEM_TIM3PWM_Period_5K	(20-1)
			#define STSTEM_TIM3PWM_Period_10K	(10-1)
			#define STSTEM_TIM3PWM_Period_20K	(5-1)
			#define STSTEM_TIM3PWM_Period_50K	(2-1)
			#define tim3arr 720-1
		/*可用API：
					HAL_TIM_PWM_Start(&TIM3_Handler,TIM_CHANNEL_2);		开启TIM3的PWM通道2
					HAL_TIM_PWM_Stop(&TIM3_Handler,TIM_CHANNEL_2);		关闭TIM3的PWM通道2，但看源码好像使所有通道都关闭了，待实验
					
					设置TIM3的PWM通道2的占空比百分数为88.8%，值需在0~100.0之间。即88.8%的低电平时间（本模板规范：低电平有效，即用电器工作电压）
					TIM3_set_Channel_Pulse(TIM3PWM_Channel_2,88.8);
					
					buzzer_bibi_once;			用户使用，蜂鸣器叫唤一声
					define buzzer_bibi_on;		用户使用，蜂鸣器间歇叫唤开启
					define buzzer_bibi_off;		用户使用，蜂鸣器间歇叫唤关闭
		*/

/*高级定时器1，专门用于产生PWM信号：三路互补PWM输出、死区控制、刹车信号输入*/
/*引脚：
				CH1/CH1N		CH2/CH2N		CH3/CH3N		CH4		BKIN（刹车信号输入）
默认			PA8/PB13		PA9/PB14		PA10/PB15		PA11	PB12
部分重映射		PA8/PA7			PA9/PB0			PA10/PB1		PA11	PA6
完全重映射		PE9/PE8			PE11/PE10		PE13/PE12		PE14	PE15
*/
/*默认并推荐不开启定时中断；引脚默认没有上下拉；初始化后默认没有打开相应通道的PWM输出，需要手动开启输出*/
/*定时器工作在向上计数时，PWM信号边缘对齐；定时器工作在向上和向下计数模式时，PWM信号中心对齐*/
#define STSTEM_TIM1PWM_ENABLE		0				/*是否启用并初始化TIM1的三路互补PWM（前三个通道）和一路PWM（通道4）*/
			#define STSTEM_TIM1PWM_useBreak	1		/*是否启用BKIN刹车信号控制输入，默认低电平有效*/
													/*选择每一个通道的有效电平和空闲电平（可能是刹车时的电平），默认死区3us，可修改*/
			#define STSTEM_TIM1PWM_REMAP_PARTIAL  0	/*定时器1部分引脚重映射，Partial remap，	引脚如上边所示*/
			#define STSTEM_TIM1PWM_REMAP_ENABLE	  0	/*定时器1全部引脚重映射，Full remap，		引脚如上边所示*/
			/*输出通道选择，共四个通道，可以相与打开多个通道，互补通道默认成对打开*/
			#define STSTEM_TIM1PWM_CHANNEL_ENABLE (B0000_0001|B0000_0010|B0000_0100|B0000_1000)		/*必须加括号括起来*/
			#define tim1arr 		STSTEM_TIM1_Period_10K	/*选择定时器1输出频率（预分频系数为72，这里选择重装值）*/
				#define STSTEM_TIM1_Period_1K	(1000-1)
				#define STSTEM_TIM1_Period_2K	(500-1)
				#define STSTEM_TIM1_Period_5K	(200-1)
				#define STSTEM_TIM1_Period_10K	(100-1)
				#define STSTEM_TIM1_Period_20K	(50-1)
				#define STSTEM_TIM1_Period_50K	(20-1)
				#define STSTEM_TIM1_Period_100K	(10-1)
				#define STSTEM_TIM1_Period_200K	(5-1)
/*可用API：
		启动通道1~4的PWM输出
		HAL_TIM_PWM_Start(&TIM1_Handler,TIM_CHANNEL_1);
		
		启动互补通道1~3的PWM输出
		HAL_TIMEx_PWMN_Start(&TIM1_Handler,TIM_CHANNEL_1);
		
		关闭通道的PWM输出（通道选择同上）
		HAL_TIM_PWM_Stop(&TIM1_Handler,TIM_CHANNEL_1);
		HAL_TIMEx_PWMN_Stop(&TIM1_Handler,TIM_CHANNEL_1);
		
		设置TIM1的PWM通道2的占空比百分数为88.8%，值需在0~100.0之间。即88.8%的低电平时间（本模板规范：低电平有效，即用电器工作电压）
		TIM1_set_Channel_Pulse(TIM1PWM_Channel_2,88.8);
*/

/*hd系列外设，其他与上同理*/
/*高级定时器8，专门用于产生PWM信号：三路互补PWM输出、死区控制、刹车信号输入*/
/*引脚：
				CH1/CH1N		CH2/CH2N		CH3/CH3N		CH4		BKIN（刹车信号输入）
				PC6/PA7			PC7/PB0			PC8/PB1			PC9		PA6
*/
/*默认并推荐不开启定时中断；引脚默认没有上下拉；初始化后默认没有打开相应通道的PWM输出，需要手动开启输出*/
/*定时器工作在向上计数时，PWM信号边缘对齐；定时器工作在向上和向下计数模式时，PWM信号中心对齐*/
/*没有重映射功能*/
#define STSTEM_TIM8PWM_ENABLE		0				/*是否启用并初始化TIM8的三路互补PWM（前三个通道）和一路PWM（通道4）*/
			#define STSTEM_TIM8PWM_useBreak	1		/*是否启用BKIN刹车信号控制输入，默认低电平有效*/
													/*选择每一个通道的有效电平和空闲电平（可能是刹车时的电平），默认死区3us，可修改*/
			/*输出通道选择，共四个通道，可以相与打开多个通道，互补通道默认成对打开*/
			#define STSTEM_TIM8PWM_CHANNEL_ENABLE (B0000_0001|B0000_0010|B0000_0100|B0000_1000)		/*必须加括号括起来*/
			#define tim8arr 		STSTEM_TIM8_Period_10K	/*选择定时器1输出频率（预分频系数为72，这里选择重装值）*/
				#define STSTEM_TIM8_Period_1K	(1000-1)
				#define STSTEM_TIM8_Period_2K	(500-1)
				#define STSTEM_TIM8_Period_5K	(200-1)
				#define STSTEM_TIM8_Period_10K	(100-1)
				#define STSTEM_TIM8_Period_20K	(50-1)
				#define STSTEM_TIM8_Period_50K	(20-1)
				#define STSTEM_TIM8_Period_100K	(10-1)
				#define STSTEM_TIM8_Period_200K	(5-1)
/*可用API：
		启动通道1~4的PWM输出
		HAL_TIM_PWM_Start(&TIM8_Handler,TIM_CHANNEL_1);
		
