Staok/stm32_framework/STM32F1_HAL_freeRTOS_Framework/SYSTEM/sys.h
	HAL_SD_CardCIDTypeDef SDCard_CID;  //SD卡制造CID
	成员：
		__IO uint8_t  ManufacturerID;  制造商ID		Manufacturer ID
		__IO uint16_t OEM_AppliID;     OEM/Application ID
		__IO uint32_t ProdName1;       Product Name part1
		__IO uint8_t  ProdName2;       Product Name part2
		__IO uint8_t  ProdRev;         Product Revision
		__IO uint32_t ProdSN;          Product Serial Number
		__IO uint8_t  Reserved1;       Reserved1
		__IO uint16_t ManufactDate;    Manufacturing Date
		__IO uint8_t  CID_CRC;         CID CRC
		__IO uint8_t  Reserved2;       Always 1
*/
/*
引脚：
PC8			SDIO_D0
PC9			SDIO/D1
PC10		SDIO_D2
PC11		SDIO_D3
PC12		SDIO_CK
PD2			SDIO_CMD
*/
/*备注：可用开发用DMA读写SD卡，这样更省时间，读写的时候就不用关中断了*/
#define SYSTEM_SDIO_SD_ENABLE	1
/*底层API：（不推荐直接读写！要用文件系统FATFS按照文件读写，并且SDIO的SD初始化就在FATFS初始化里）
	一个块的大小：SDCardInfo.LogBlockSize
	SD卡块的数量：SDCardInfo.LogBlockNbr
	u8 SD_ReadDisk(buf,secaddr,seccnt);			//读取从第secaddr块开始的seccnt个块的内容，返回地址到buf（大概率一个块为512KB，buf必须先准备好足够空间）
												//返回 HAL_OK （值为0） 为成功，其他为失败
														
	u8 SD_WriteDisk(buf,secaddr,seccnt);		//把buf内的内容从secaddr块开始写入，连续写seccnt个块
												//返回 HAL_OK （值为0） 为成功，其他为失败
	
	void show_sdcard_info(void);				//通过串口1打印SD卡相关信息
	
	计算SD卡容（单位为字节）：
		uint64_t CardCap = (uint64_t)(SDCardInfo.LogBlockNbr)*(uint64_t)(SDCardInfo.LogBlockSize);	 //计算SD卡容量（单位为字节）
		CardCap>>20 //此为转换为MB单位
*/

/*使用FATFS文件系统管理SD卡，FATSF支持FAT12/FAT16/FAT32/exFAT，官网（含API说明）：http://elm-chan.org/fsw/ff/00index_e.html*/
/*配置相关：在 ffconf.h 文件里
	注意：	默认没有支持相对路径，如需可在FATFS配置文件内打开
			默认配置支持4个文件设备，默认使用UTF-8编码
	配置：	定义有哪些设备，比如DEV_ExFLASH（外部FLASH，MMC/NAND/SPI FLASH等）、DEV_SD、DEV_InrFlash（内部FLASH）、DEV_USB等等
			在diskio.c里面定义读写以上这些设备的底层函数：（底层函数，应用层不应调用）
				DSTATUS disk_initialize (BYTE pdrv);
				DSTATUS disk_status (BYTE pdrv);	//由于存储设备自己实现的读写函数内部含有忙判断，所以这个获取设备状态函数不用
				DRESULT disk_read (BYTE pdrv, BYTE* buff, LBA_t sector, UINT count);
				DRESULT disk_write (BYTE pdrv, const BYTE* buff, LBA_t sector, UINT count);
				DRESULT disk_ioctl (BYTE pdrv, BYTE cmd, void* buff);
	配置：	在ffsystem.c里面已经用自实现的内存分配和释放函数，默认用STM32内部的RAM，如要使用外部RAM可去手动改为 ExRAM1
	配置：	FATFS的配置文件里有一个没有完全配置好：ffconf.h里在最后的RTOS支持
*/
#define SYSTEM_FATFS_ENABLE	0 //TODO:FATFS初始化还没有放到系统初始化序列，等原子的API移植好了，这个宏用于控制是否初始化和相关API的编译控制
/*初始化步骤：
	要做的：在初始化系列里加上FATFS初始化SD卡
			先为每个文件设备句柄申请空间
			挂载
			
			更多文件操作可用参考原子FATFS历程里的 fattester.c 和 exfuns.c 里面的获取剩余空间、识别文件类型、得到文件夹大小、文件和文件夹复制等有用的API等等
			
			FATFS可用API：参考原子的，罗列下来API，参考官方文档等
*/


/*hd系列外设，FSMC*/
/*FSMC为16位数据线，分为四个256MB的块（28跟地址线）（地址从0x6000 0000开始，第二个块开始在0x7000 0000，以此类推），每一块分为四个64MB的区（BANK1~4）*/
/*第一个块用于NOR/SRAM，第二、三个块用于NAND，第四个块用于PC卡，块一属于NOR FLASH控制器，块二、三和四属于NAND FLASH控制器*/
/*
一般接法：（CE前面加一个N，表示CE低有效，其他同理）
	FSMC			SRAM					LCD
	NEx				NCE（低选中）			CS（低选中）
	NOE				NOE（低使能输出）		RD（低读）
	NWE				NWE（高读低写）			WR（低写）
											RS（高数据低命令）——可接至FSMC的一个地址脚如A10
	NUB				NUB（低选高八位）
	NLB				NLB（低选低八位）
	A[x:0]			A[x:0]（地址，可乱序）
	D[15:0]									D[15:0]（数据）
*/
/*原子的FSMC驱动LCD历程的解释：时序选择模式A，RS连接到了A10
	typedef struct
	{
		vu16 LCD_REG;	//0111 1111 1110 0X7FE
		vu16 LCD_RAM;	//1000 0000 0000 0X7FE+0x02
	}LCD_TypeDef;
	#define LCD_BASE        ((u32)(0x6C000000 | 0x000007FE))
	#define LCD             ((LCD_TypeDef *) LCD_BASE)
	
	0x7FE为：	0111 1111 1110（因为FSMC选择了16位模式，实际地址脚为0x7FE再右移1）
	右移之后  0011 1111 1111 此为LCD->LCD_REG的 实际地址脚 情况，此时A10为0，LCD->LCD_RAM的地址为LCD->LCD_REG地址+2
	LCD->LCD_REG 的地址脚 0011 1111 1111		A10为0 	RS低地址
	LCD->LCD_RAM 的地址脚 0100 0000 0001		A10为1	RS高数据
	这样命令和数据就区分开了
	
	然后读写：（读写相关的CS、WR和RD脚等的电平由FSMC自动设置）
		写：	LCD->LCD_REG = LCD_Reg;				//要写的寄存器地址 
				LCD->LCD_RAM = LCD_RegValue;		//写入一个16位数据
		读：	LCD_WR_REG(LCD_Reg);				//先写寄存器地址
				vu16 LCD_RegValue = LCD->LCD_RAM;	//再读出一个16位数据
*/
/*可以用FSMC同时管理LCD和SRAM（对于MCU来说，外部FLASH可以用SPI的FLASH当作文件系统使用（如存图、当USB U盘或者IAP等等），不用上NOR/NAND之流，那是对MPU的）
	这是对于不带LTDC LCD外设的如STM32F429以下的如STM32F1和STM32F40x系列而言
  对于STM32F429，可以用LTDC LCD单独驱动LCD
*/
/*
  如果实际使用了大容量系列和100脚以上系列的片子但是没有LTDC，推荐用FSMC同时管理LCD和SRAM*/
#define SYSTEM_FSMC_ENABLE	0				//是否启用FSMC
	#define SYSTEM_FSMC_use4LCD		0		//启用FSMC用于驱动LCD，则相关代码被编译，相关API可用
	#define SYSTEM_FSMC_use4SRAM	0		//启用FSMC用于驱动SRAM，则相关代码被编译，相关API可用
/*
用于LCD的部分：
	  可用API详看TFTLCD.h

用于SRAM的部分：
	这里默认用的 块1（NORSRAM块）的区域3（区域4留给LCD喽~）（块1的区3和区4分别留给外部RAM和LCD，本模板默认，否则还得改地址）
	默认用于驱动IS62WV51216，地址线范围为A0~A18，数据线范围D0~D15，（NUB、NLB、NWE、NOE、NCE五根控制线都对应接好）
	底层API：（不推荐直接调用，使用自实现的malloc和free）（以字节为单位）
		u32 testsram[250000] __attribute__((at(SRAM1_BANK3_ADDR))); 	//地址定义在外部SRAM中
		void FSMC_SRAM_WriteBuffer(u8 *pBuffer,u32 WriteAddr,u32 n); 	//写 参数：数据指针，外部SRAM内的地址(从0开始)，写入的字节数
		void FSMC_SRAM_ReadBuffer(u8 *pBuffer,u32 ReadAddr,u32 n);   	//读 类似上
*/
/*
内存管理：先到malloc.h里面定义有几块RAM，RAM的标志位，和各个RAM给内存管理分配的空间
	应用层API：（分配内存的数量以字节为单位）
		my_mem_init(InrRAM);				//初始化内部内存池（系统自带）
		my_mem_init(ExRAM1);				//初始化外部内存池（如果不开启SYSTEM_FSMC_use4SRAM则没有这句话）
		
		void myfree(u8 memx,void *ptr);  			//内存释放
		void *mymalloc(u8 memx,u32 size);			//内存分配
		void *myrealloc(u8 memx,void *ptr,u32 size);//重新分配内存
*/



/*_____________系统函数_______________*/
extern u16	StartUpTimes;					/*用于保存开机次数，储存在最后一个或倒数第二个页*/
extern uint32_t UIDw[3]; 					/*保存STM32内部UID识别码，全球唯一识别码*/
extern uint32_t sysCoreClock; 				/*获取HCLK频率，外设时钟均来自此再分频*/

void sys_MCU_Init_Seq(void);				/*MCU外设初始化序列，所有初始化写到这里面*/
void sys_Device_Init_Seq(void);				/*器件外设初始化，并开机自检*/

void FaultASSERT(char* FaultMessage);		/*表示初始化有问题，串口提示，指示灯或者蜂鸣器进行提示*/
int8_t Stm32_Clock_Init(uint32_t PLL);		/*时钟系统配置*/

#if SYSTEM_UART1_ENABLE||SYSTEM_UART2_ENABLE||SYSTEM_UART3_ENABLE
	
	#define USART1_RX_BUF_MaxNum 	200 	/*定义用协议0只接受以'\r\n'结尾的数据时可以存在字符数组里面的最大字节数目*/
	#define USART1_RX_FIFO_MaxNum	200		/*定义用协议1用FIFO存储数据时可以存的最大字节数目*/
	
	#define UART1	1
	#define UART2	2
	#define UART3	3
	#define RXBUFFERSIZE   1 					//缓存大小
	extern u8 aRxBuffer1[RXBUFFERSIZE],aRxBuffer2[RXBUFFERSIZE],aRxBuffer3[RXBUFFERSIZE];//HAL库使用的串口接收缓冲
	extern UART_HandleTypeDef UART1_Handler,UART2_Handler,UART3_Handler; //UART句柄
	void sys_USART1_ENABLE(void);
	void sys_USART2_ENABLE(void);
	void sys_USART3_ENABLE(void);
	
	
	#define USART1_RX_DONE_mask 0x8000
	#define USART1_RX_MODE_mask 0x4000
	#define USART1_RX_Rec_r_mask 0x2000
	#define USART1_RX_Num_mask 0x1fff /*0001 1111 1111 1111*/
	
	extern u16 USART1_RX_CONFIG;	/*    x            x           x        x xxxx xxxx xxxx      */
									/*(接受完成) (协议模式0/1) (接收到\r)   串口1接受数据字节计数 */
									/*串口1接受协议：0为只接受以'\r\n'结尾的数据，1为以FIFO先进先出实现接受区，无协议*/
	
	#define USART1_SetDone 		USART1_RX_CONFIG |= (USART1_RX_DONE_mask) /*设置串口1接收完成标志位*/
	#define USART1_SetUnDone 	USART1_RX_CONFIG &= (USART1_RX_MODE_mask) /*在任务中处理完后对串口1标志位进行复位，除了mode位，其他位都写0*/
	#define USART1_SetMode(x) 	USART1_RX_CONFIG |= (((u16)x)<<14) 		/*用户可用，在任务中设置串口1接收协议*/
	#define USART1_isDone 		((USART1_RX_CONFIG) & (USART1_RX_DONE_mask))/*用户用，用于判断是否接受完成一次*/
	#define USART1_RX_ByteNum 	((USART1_RX_CONFIG) & (USART1_RX_Num_mask))/*用户可用，返回接收的字符数量*/
	
//	extern QueueHandle_t Uart1_fifo;
	char sys_USART1_RX_Fetch(u8 is_print, char *buf,u16 *RX_ByteNum);
	
	
#endif

