Staok/stm32_framework/STM32F1_HAL_freeRTOS_Framework/SYSTEM/sys.h
#if SYSTEM_MCO_PA8_OUT
	void sys_MCO_Out_Enable(void);				/*MCO在PA8上输出启动，默认时钟源HSE*/
#endif

#if STSTEM_TIM4_ENABLE

	__packed struct TIM4_IT_FLAGS
	{
		u8 _10msec_flag;	//10毫秒标志和计数
		u16 _10msec;
		
		u8 _100msec_flag;	//100毫秒标志和计数
		u16 _100msec;
		
		u8 _300msec_flag;	//300毫秒标志
		
		u8 _1sec_flag;		//1秒标志和计数
		u16 _1sec;
		
		u8 _1min_flag;		//1分钟标志和计数
		u16 _1min;
	};
	extern struct TIM4_IT_FLAGS Timer_IT_flags;
	extern TIM_HandleTypeDef TIM4_Handler;      //通用定时器4句柄 
	void sys_TIM4_ENABLE(void);
#endif
	
#if STSTEM_TIM3PWM_ENABLE
	/*蜂鸣器连接在通道4上*/
	extern u8 is_buzzer_once;
	extern u8 is_buzzer_bibi;
	#define buzzer_bibi_once	is_buzzer_once = 1;  //用户使用，蜂鸣器叫唤一声
	#define buzzer_bibi_on		is_buzzer_bibi = 1;  //用户使用，蜂鸣器间歇叫唤开启
	#define buzzer_bibi_off		is_buzzer_bibi = 0;  //用户使用，蜂鸣器间歇叫唤关闭
	extern TIM_HandleTypeDef 	TIM3_Handler;      	//定时器3句柄
	extern TIM_OC_InitTypeDef 	TIM3_CH1Handler,TIM3_CH2Handler,TIM3_CH3Handler,TIM3_CH4Handler;	//定时器3通道1-4句柄
	#define TIM3PWM_Channel_1	1
	#define TIM3PWM_Channel_2	2
	#define TIM3PWM_Channel_3	3
	#define TIM3PWM_Channel_4	4
	void sys_TIM3PWM_ENABLE(void);
	void TIM3_set_Channel_Pulse(u8 channel,float percent);
#endif

#if SYSTEM_IWDG_ENABLE
	extern IWDG_HandleTypeDef IWDG_Handler; //独立看门狗句柄
	void sys_IWDG_ENABLE(void);
	void IWDG_Feed(void);
#endif

#if SYSTEM_CRC_ENABLE
	#define BUFFER_SIZE    114
	extern CRC_HandleTypeDef hcrc;
	extern const uint32_t aDataBuffer[BUFFER_SIZE];
	extern uint32_t uwExpectedCRCValue;
	void sys_CRC_ENABLE(void);
	void HAL_CRC_MspInit(CRC_HandleTypeDef* hcrc);
#endif

#if SYSTEM_RTC_ENABLE
	extern RTC_HandleTypeDef RTC_Handler;  //RTC句柄
	//时间结构体
	typedef struct 
	{
		vu8 hour;
		vu8 min;
		vu8 sec;			
		//公历日月年周
		vu16 w_year;
		vu8  w_month;
		vu8  w_date;
		vu8  week;	
	}_calendar_obj;					 
	extern _calendar_obj calendar;				//用户用！RTC结构体，实际用时只需要读这个结构体获取时间即可
	char sys_RTC_Enable(void);						/*RTC配置*/
	u8 Is_Leap_Year(u16 year);					//平年,闰年判断
	u8 RTC_Get(void);         					//获取时间，在RTC秒中断中执行，自动更新calendar时间，用户不用管
	u8 RTC_Get_Week(u16 year,u8 month,u8 day);
	u8 RTC_Set(u16 syear,u8 smon,u8 sday,u8 hour,u8 min,u8 sec);		//用户用！设置时间	
	u8 RTC_Alarm_Set(u16 syear,u8 smon,u8 sday,u8 hour,u8 min,u8 sec);	//用户用！设置闹钟
	//HAL_StatusTypeDef HAL_RTC_SetAlarm_IT (RTC_HandleTypeDef * hrtc, RTC_AlarmTypeDef * sAlarm,uint32_t Format);
#endif

/*_______________________________定时器2___________________________________*/
#if STSTEM_TIM2_ENABLE
	extern TIM_HandleTypeDef TIM2_Handler;
	void sys_TIM2_ENABLE(void); //写在预编译外面为了外部文件能够调用
	#if (STSTEM_TIM2_asPWMorCap == 0)
		#define TIM2PWM_Channel_1	1
		#define TIM2PWM_Channel_2	2
		#define TIM2PWM_Channel_3	3
		#define TIM2PWM_Channel_4	4
		extern TIM_OC_InitTypeDef 	TIM2_CH1Handler,TIM2_CH2Handler,TIM2_CH3Handler,TIM2_CH4Handler;
		void TIM2_set_Channel_Pulse(u8 channel,float percent);
	#elif (STSTEM_TIM2_asPWMorCap == 1)
		extern TIM_IC_InitTypeDef TIM2_CHxConfig;
		void Process_TIM2_IC_CallBack_Channel_1(void);
		void Process_TIM2_IC_CallBack_Channel_2(void);
		void Process_TIM2_IC_CallBack_Channel_3(void);
		void Process_TIM2_IC_CallBack_Channel_4(void);
	#elif (STSTEM_TIM2_asPWMorCap == 3)
		extern TIM_Encoder_InitTypeDef sEncoderConfig;
	#endif
	
	/*输入捕获私有变量*/
	extern u8  	TIM2CHx_CAPTURE_STA;	    				
	extern u16	TIM2CHx_CAPTURE_VAL;
	float Peek_TIM2_Cap_Val(void);

	/*正交解码私有变量*/
	extern int32_t EncoderOverflowCount;//定时器溢出次数
	float peek_TIM2_Encoder_Speed(void);
	int32_t peek_TIM2_Encoder_Value(void);
#endif

/*_______________________________TIM1PWM___________________________________*/
#if STSTEM_TIM1PWM_ENABLE
		void sys_TIM1PWM_ENABLE(void);
		extern TIM_HandleTypeDef TIM1_Handler;
		#define TIM1PWM_Channel_1	1
		#define TIM1PWM_Channel_2	2
		#define TIM1PWM_Channel_3	3
		#define TIM1PWM_Channel_4	4
		void TIM1_set_Channel_Pulse(u8 channel,float percent);
#endif

/*_______________________________TIM8PWM___________________________________*/

#if (STSTEM_TIM8PWM_ENABLE) && ((STM32F103xG) || (STM32F103xE))
		extern TIM_HandleTypeDef TIM8_Handler;
		void sys_TIM8PWM_ENABLE(void);
		#define TIM8PWM_Channel_1	1
		#define TIM8PWM_Channel_2	2
		#define TIM8PWM_Channel_3	3
		#define TIM8PWM_Channel_4	4
		void TIM8_set_Channel_Pulse(u8 channel,float percent);
#endif

/*_______________________________TIM6___________________________________*/

#if (STSTEM_TIM6_ENABLE) && ((STM32F103xG) || (STM32F103xE))
	void sys_TIM6_ENABLE(void);
	extern TIM_HandleTypeDef TIM6_Handler;
#endif
/*_______________________________TIM7___________________________________*/

#if (STSTEM_TIM7_ENABLE) && ((STM32F103xG) || (STM32F103xE))
	void sys_TIM7_ENABLE(void);
	extern TIM_HandleTypeDef TIM7_Handler;
#endif


/*_______________________________ADC1___________________________________*/

#if SYSTEM_ADC1_ENABLE
	void ADC_RegularChannelConfig(ADC_HandleTypeDef *AdcHandle, uint32_t Channel, uint32_t Rank, uint32_t SamplingTime);
	u16 Get_Adc(u32 ch);
	#if SYSTEM_ADC1_useScan
		extern DMA_HandleTypeDef  ADC1rxDMA_Handler;
		void ADC_DMA_Cfg(void);
	#endif
	
	extern ADC_HandleTypeDef ADC1_Handler;
	void sys_ADC1_ENABLE(void);
	u32 Get_Adc_Average(u32 ch,u8 times);
	float Get_Temprate(u32 adcx);
#endif

/*_______________________________SPI1、2________________________________*/

#if (SYSTEM_SPI1_ENABLE) || (SYSTEM_SPI1_ENABLE)
extern SPI_HandleTypeDef SPI1_Handler;  //SPI1句柄
extern SPI_HandleTypeDef SPI2_Handler;  //SPI2句柄
void sys_SPI1_ENABLE(void);
void sys_SPI2_ENABLE(void);
void SPI1_SetSpeed(u8 SPI_BaudRatePrescaler);
void SPI2_SetSpeed(u8 SPI_BaudRatePrescaler);

//写读8字节
u8 SPI1_ReadWriteByte_8Byte(u8 TxData);
//写读16字节，传入一个包含2字节的u8*指针
u8 SPI1_ReadWriteByte_16Byte(u8* TxData);
//写8字节
u8 SPI1_WriteByte_8Byte(u8 TxData);
//写16字节，传入一个包含2字节的u8*指针
u8 SPI1_WriteByte_16Byte(u8* TxData);

u8 SPI2_ReadWriteByte(u8 TxData);

void sys_SPI1_SS_io_Init(void);
void sys_SPI2_SS_io_Init(void);

#endif
/*_________________________________低功耗StandbyMode________________________________*/

#if SYSTEM_StdbyWKUP_ENABLE
	void sys_StdbyWKUP_ENABLE(void);
	void sys_CheckWKUP_4RTOS(void);
	#define WKUP_KD HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_0)  //PA0 检测是否外部WK_UP按键按下
	u8 Check_WKUP(void);  			//检测WKUP脚的信号
	void Sys_Enter_Standby(void);	//系统进入待机模式
#endif

/*____________________________FLASH编程___________________________________*/

#if SYSTEM_FLASH_IAP_ENABLE
	void STMFLASH_Read(		u32 ReadAddr,	u16 *pBuffer,	u16 NumToRead);		//可用API
	void STMFLASH_Write(	u32 WriteAddr,	u16 *pBuffer,	u16 NumToWrite);	//可用API
	#if STM32_FLASH_WREN	//如果使能了写   
		extern void FLASH_PageErase(uint32_t PageAddress);
		void STMFLASH_Write_NoCheck(u32 WriteAddr,u16 *pBuffer,u16 NumToWrite);
	#endif

