Staok/stm32_framework/STM32F1_HAL_freeRTOS_Framework/SYSTEM/sys.h
	u16 STMFLASH_ReadHalfWord(u32 faddr);
#endif

/*_____________________________________DAC________________________________________*/

#if ((SYSTEM_DAC_OUT1_ENABLE) || (SYSTEM_DAC_OUT2_ENABLE)) && ((STM32F103xG) || (STM32F103xE))
	extern DAC_HandleTypeDef DAC1_Handler;//DAC句柄
	void sys_DAC_ENABLE(void);
	void HAL_DAC_MspInit(DAC_HandleTypeDef* hdac);
	void DAC_Set_Ch1_Vol(float vol);
	void DAC_Set_Ch2_Vol(float vol);
#endif



/*____________________SDIO SD_____________________________________________*/

#if (SYSTEM_SDIO_SD_ENABLE) && ((STM32F103xG) || (STM32F103xE))
	extern HAL_SD_CardInfoTypeDef  	SDCardInfo;              	//SD卡信息
	extern HAL_SD_CardCIDTypeDef	SDCard_CID;					//SD卡CID信息
	extern SD_HandleTypeDef        	SDCARD_Handler;     		//SD卡句柄
	#define SD_TIMEOUT 			((uint32_t)100000000)  			//超时时间

	u8 SD_Init(void);
	u8 SD_ReadDisk(u8* buf,u32 sector,u32 cnt);
	u8 SD_WriteDisk(u8 *buf,u32 sector,u32 cnt);
	void show_sdcard_info(void);						//通过串口1打印SD卡相关信息

#endif

/*____________________________FSMC for SARM_____________________________________________*/
#if ((SYSTEM_FSMC_ENABLE) && (SYSTEM_FSMC_use4SRAM)) && ((STM32F103xG) || (STM32F103xE))

	extern SRAM_HandleTypeDef SRAM_Handler;    //SRAM句柄
	//使用NOR/SRAM的 Bank1.sector3,地址位HADDR[27,26]=10 
	//对IS61LV25616/IS62WV25616,地址线范围为A0~A17 
	//对IS61LV51216/IS62WV51216,地址线范围为A0~A18
	#define SRAM1_BANK3_ADDR    ((u32)(0x68000000))	//计算： (0x6000 0000 | ((u32)64*1024*1024*(3 - 1)))

	void sys_FSMC_SRAM_ENABLE(void);
	void FSMC_SRAM_WriteBuffer(u8 *pBuffer,u32 WriteAddr,u32 n);
	void FSMC_SRAM_ReadBuffer(u8 *pBuffer,u32 ReadAddr,u32 n);

#endif


/*____________________________FSMC for LCD_____________________________________________*/
#if ((SYSTEM_FSMC_ENABLE) && (SYSTEM_FSMC_use4LCD)) && ((STM32F103xG) || (STM32F103xE))
	extern SRAM_HandleTypeDef TFTSRAM_Handler;    //SRAM句柄(用于控制LCD)

	void LCD_with_FSMC_init_FSMC(void);
	//LCD地址结构体
	typedef struct
	{
		vu16 LCD_REG;
		vu16 LCD_RAM;
	} LCD_TypeDef;
	//使用NOR/SRAM的 Bank1.sector4,地址位HADDR[27,26]=11 A10作为数据命令区分线 
	//注意设置时STM32内部会右移一位对其! 			    
	#define LCD_BASE        ((u32)(0x6C000000 | 0x000007FE))
	#define LCD             ((LCD_TypeDef *) LCD_BASE)
#endif
	
	

void delay_init(void);
void delay_ms(uint16_t nms);
void delay_xms(uint16_t nms);
void delay_us(uint32_t nus);


/*Author:		MaxwellXyao*/
#define BIT(n) 					(1 << n) 				//位mask
#define bit_SetTrue(x,mask) 	(x |= mask)				//该位设置为真
#define bit_SetFalse(x,mask)	(x &= ~mask)			//该位设置为假
#define bit_Toggle(x,mask) 		(x ^= mask)				//位切换
#define bit_IsTrue(x,mask) 		((x & mask) != 0)		//该位是否真
#define bit_IsFalse(x,mask) 	((x & mask) == 0)		//该位是否假

//以下为汇编函数
void WFI_SET(void);		//执行WFI指令
void INTX_DISABLE(void);//关闭所有中断
void INTX_ENABLE(void);	//开启所有中断
void MSR_MSP(uint32_t addr);	//设置堆栈地址

#endif


